In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [2]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df['Z'].sum()

2.159355964833395

In [5]:
df['new']= df['W']+df['Z']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [6]:
df.drop('new',axis=1, inplace =True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
df.drop('E')
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [9]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [10]:
df.loc['B','Y']

-0.8480769834036315

In [11]:
df.loc[['B','C'],['Y','Z']]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001

In [12]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [13]:
df[df['W']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [14]:
df[(df['W']>0)&(df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
newind = 'CA WY NY CO TX'.split()

In [17]:
newind

['CA', 'WY', 'NY', 'CO', 'TX']

In [18]:
df['States'] = newind

In [19]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     WY
C -2.018168  0.740122  0.528813 -0.589001     NY
D  0.188695 -0.758872 -0.933237  0.955057     CO
E  0.190794  1.978757  2.605967  0.683509     TX

In [20]:
df_new = df.set_index('States')

In [21]:
df_new

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
WY      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
CO      0.188695 -0.758872 -0.933237  0.955057
TX      0.190794  1.978757  2.605967  0.683509

In [22]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     WY
C -2.018168  0.740122  0.528813 -0.589001     NY
D  0.188695 -0.758872 -0.933237  0.955057     CO
E  0.190794  1.978757  2.605967  0.683509     TX

In [23]:
outside=['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]

In [24]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [25]:
inside

[1, 2, 3, 1, 2, 3]

In [26]:
hier_index = list(zip(outside,inside))

In [27]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [28]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [29]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [33]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [34]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [45]:
df.loc['G1'].loc[1:3]['B']

1   -0.754070
2    0.484752
3    1.901755
Name: B, dtype: float64

In [47]:
df.xs('G1')

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [49]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [50]:
df.xs(1, level='')

KeyError: 'Level  not found'

In [51]:
d ={'A':[1,np.nan,3],'B':[np.nan,np.nan,3],'C':[1,2,3]}

In [52]:
d

{'A': [1, nan, 3], 'B': [nan, nan, 3], 'C': [1, 2, 3]}

In [53]:
df_d = pd.DataFrame(d)

In [54]:
df_d

     A    B  C
0  1.0  NaN  1
1  NaN  NaN  2
2  3.0  3.0  3

In [55]:
df_d.dropna()

     A    B  C
2  3.0  3.0  3

In [57]:
df_d.dropna(axis=1)

   C
0  1
1  2
2  3

In [59]:
df_d.dropna(thresh=2)

     A    B  C
0  1.0  NaN  1
2  3.0  3.0  3

In [60]:
df_d.fillna(value='fill')

      A     B  C
0   1.0  fill  1
1  fill  fill  2
2   3.0   3.0  3

In [61]:
df_d['A'].fillna(value=df_d['A'].mean())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [63]:
df_d['B'].fillna(value=df_d['C'].mean())

0    2.0
1    2.0
2    3.0
Name: B, dtype: float64